## Unione dataset

In [2]:
import pandas as pd
import numpy as np

import os

### **disfold.com**

In [3]:
base_directory = 'de-sources-2022-2023/'
file_name = 'disfold.com'
file_path = os.path.join(base_directory, file_name)

file_list = os.listdir(file_path)
print(file_list)

['avengers-disfold.json', 'DeBiGa-disfold.json', 'FR-disfold.csv', 'GioPonSpiz-disfold.json', 'gren-disfold.com.json', 'iGMM-disfold.json', 'MalPatSaj-disfold.com.xlsx', 'MarScoToc-Disfold.csv', 'silvestri-disfold.com.csv', 'slytherin-disfold.com.json']

In [4]:
disfold = [] #Mergio prima di tutti i dataset disfold

for i in file_list:
  if('disfold' in i):
    disfold.append(i)

disfold.sort()
print(disfold)
len(disfold)

['DeBiGa-disfold.json', 'FR-disfold.csv', 'GioPonSpiz-disfold.json', 'MalPatSaj-disfold.com.xlsx', 'avengers-disfold.json', 'gren-disfold.com.json', 'iGMM-disfold.json', 'silvestri-disfold.com.csv', 'slytherin-disfold.com.json']

9

In [6]:
from IPython.core.display import json

disfold_datasets = []

for i in range(len(disfold)):
  file_path_dis = os.path.join(file_path, disfold[i])
  if('.csv' in disfold[i]):
    df = pd.read_csv(file_path_dis)
  elif('.xlsx' in disfold[i]):
    df = pd.read_excel(file_path_dis)
  elif('.json' in disfold[i]):
    try:
      df = pd.read_json(file_path_dis)
    except:
      df = pd.read_json(file_path_dis, lines = True)
  disfold_datasets.append(df)

c:\Users\giord\anaconda3\lib\site-packages\openpyxl\worksheet\header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

In [7]:
disfold_datasets[0].columns

Index(['name', 'market_cap', 'stock', 'country', 'sector', 'industry',
       'headquarters', 'founded', 'employees', 'ceo'],
      dtype='object')

In [8]:
disfold_datasets[0].rename(columns={'founded': 'founded_year',
                                    'employees': 'number_of_employees'}, inplace = True)
disfold_datasets[0].head(5)

,name,market_cap,stock,country,sector,industry,headquarters,founded_year,number_of_employees,ceo
0,"Avis Budget Group, Inc.",$18.12 B,CAR,United States,Industrials,Rental & Leasing Services,"Parsippany,NJ,UnitedStates",2006,"16,000",Mr. Joseph A. Ferraro
1,Telefônica Brasil SA,$20.19 B,VIV,Brazil,Communication Services,Telecom Services,"SÃ£oPaulo,SP,Brazil",1998,"34,000",Mr. Christian Mauad Gebara
2,East Japan Railway Company,$22.78 B,9020,Japan,Industrials,Railroads,"Tokyo,Japan",,"71,973",Mr. Yuji Fukasawa
3,Twilio Inc.,$26.09 B,TWLO,United States,Communication Services,Internet Content & Information,"SanFrancisco,CA,UnitedStates",2008,"7,867",Mr. Jeffrey Lawson
4,"Delta Electronics, Inc.",$24.05 B,2308,Taiwan,Technology,Electronic Components,"Taipei,Taiwan",,,Mr. Ping Cheng

In [9]:
disfold_datasets[1].columns

Index(['Founded', 'Top Competitor', 'Employees', 'CEO', 'Name'], dtype='object')

In [10]:
disfold_datasets[1].rename(columns={'Name': 'name',
                    'Founded': 'founded_year',
                    'Top Competitor': 'top competitor',
                    'Employees': 'number_of_employees',
                    'CEO': 'ceo'
                    }, inplace = True)
disfold_datasets[1]

,founded_year,top competitor,number_of_employees,ceo,name
0,"Founded: April 1, 1976",Samsung,"Employees: 100,000",CEO: Mr. Timothy D. Cook,Apple
1,"Founded: April 4, 1975",Oracle,"Employees: 181,000",CEO: Mr. Satya Nadella,Microsoft
2,NaN,ExxonMobil,NaN,CEO: Mr. Amin H. Nasser,Aramco
3,"Founded: October 2, 2015",Meta,"Employees: 156,500",CEO: Mr. Sundar Pichai,Alphabet
4,"Founded: July 5, 1994",Alibaba,"Employees: 1,608,000",CEO: Mr. Andrew R. Jassy,Amazon
...,...,...,...,...,...
894,Founded: 1930,Chubb Limited,"Employees: 20,300",CEO: Mr. Thomas Sinnickson Gayner,Markel Corporation
895,Founded: 1939,"Marsh & McLennan Companies, Inc.","Employees: 12,023","CEO: Mr. J. Powell Brown C.P.C.U., CPCU","Brown & Brown, Inc."
896,NaN,Accenture,"Employees: 16,196",CEO: Mr. Shingo Konomoto,Nomura Research Institute Ltd
897,Founded: 1986,Las Vegas Sands Corp.,"Employees: 52,000",CEO: Mr. William Joseph Hornbuckle IV,MGM Resorts International
898,NaN,JPMorgan,"Employees: 9,594",NaN,Mega Financial Holding Co. Ltd

In [11]:
disfold_datasets[2].columns

Index(['name', 'marketCap', 'stock', 'sector', 'industry', 'country'], dtype='object')

In [12]:
disfold_datasets[2].rename(columns={'marketCap': 'market_cap'
                    }, inplace = True)
disfold_datasets[2].head(5)

,name,market_cap,stock,sector,industry,country
0,Apple Inc.,$2.825 T,AAPL,Technology,Consumer Electronics,United States
1,Microsoft Corporation,$2.328 T,MSFT,Technology,Software—Infrastructure,United States
2,Saudi Arabian Oil Company,$2.297 T,2222,Energy,Oil & Gas Integrated,Saudi Arabia
3,Alphabet Inc.,$1.825 T,GOOG,Communication Services,Internet Content & Information,United States
4,"Amazon.com, Inc.",$1.642 T,AMZN,Consumer Discretionary,Internet Retail,United States

In [13]:
disfold_datasets[3].columns

Index(['Unnamed: 0', 'Name', 'MarketCap', 'Stock', 'Country', 'Sector',
       'Industry'],
      dtype='object')

In [14]:
disfold_datasets[3] = disfold_datasets[3].drop('Unnamed: 0', axis = 1)
disfold_datasets[3].rename(columns={'Name': 'name',
                    'MarketCap': 'market_cap',
                    'Stock': 'stock',
                    'Country': 'country',
                    'Sector': 'sector',
                    'Industry': 'industry'}, inplace = True)
disfold_datasets[3].head(5)

,name,market_cap,stock,country,sector,industry
0,Apple Inc.,$2.825 T,AAPL,United States,Technology,Consumer Electronics
1,Microsoft Corporation,$2.328 T,MSFT,United States,Technology,Software—Infrastructure
2,Saudi Arabian Oil Company,$2.297 T,2222,Saudi Arabia,Energy,Oil & Gas Integrated
3,Alphabet Inc.,$1.825 T,GOOG,United States,Communication Services,Internet Content & Information
4,"Amazon.com, Inc.",$1.642 T,AMZN,United States,Consumer Discretionary,Internet Retail

In [15]:
disfold_datasets[4].columns

Index(['id', 'name', 'official_name', 'headquarters_country',
       'headquarters_continent', 'founded', 'employees', 'ceo', 'market_cap',
       'categories', 'gbp'],
      dtype='object')

In [16]:
disfold_datasets[4].rename(columns={'founded': 'founded_year',
                                    'employees': 'number_of_employees'
                    }, inplace = True)
disfold_datasets[4].head(5)

,id,name,official_name,headquarters_country,headquarters_continent,founded_year,number_of_employees,ceo,market_cap,categories,gbp
0,1e4dfb844d5a47e39c14699648cbd55a,Apple,Apple Inc.,Cupertino,CA,"April 1, 1976","100,000",Mr. Timothy D. Cook,$2.825 Trillion,"[UnitedStates, Technology, ConsumerElectronics...",NaN
1,031f69c6c7fd49d89b00ecdfcd294bad,Danaher,Danaher Corporation,Washington,DC,1969,"78,000",Mr. Rainer M. Blair,$208.03 Billion,"[UnitedStates, Healthcare, Diagnostics&Researc...",NaN
2,8acd1acfe59d4fc88c28038c9d3e8911,Merck,"Merck & Co., Inc.",Kenilworth,NJ,1891,"67,000",Mr. Robert M. Davis J.D.,$210.38 Billion,"[UnitedStates, Healthcare, DrugManufacturers—G...",NaN
3,ba6efa594766439dafb4045f0b25a23a,Bhp,BHP Group,Melbourne,VIC,1885,"40,110","Mr. Mike P. Henry B.Sc., BSc (Chem)",A$281.66 Billion,"[Australia, BasicMaterials, OtherIndustrialMet...",$211.25 Billion
4,83d47a2c8bd545cf80c17abfa6d81cf9,Nike,"Nike, Inc.",Beaverton,OR,"January 25, 1964","73,300",Mr. John J. Donahoe II,$213.60 Billion,"[UnitedStates, ConsumerDiscretionary, Footwear...",NaN

In [17]:
disfold_datasets[5].columns

Index(['name', 'market_capitalization_USD', 'stock', 'country', 'sector',
       'industry'],
      dtype='object')

In [18]:
disfold_datasets[5].rename(columns={'market_capitalization_USD': 'market_cap'}, inplace = True)
disfold_datasets[5]['market_cap']=disfold_datasets[5]['market_cap'].astype(object)
disfold_datasets[5].head(5)

,name,market_cap,stock,country,sector,industry
0,Apple Inc.,2825000000000,AAPL,United States,Technology,Consumer Electronics
1,Microsoft Corporation,2328000000000,MSFT,United States,Technology,Software—Infrastructure
2,Saudi Arabian Oil Company,2297000000000,2222,Saudi Arabia,Energy,Oil & Gas Integrated
3,Alphabet Inc.,1825000000000,GOOG,United States,Communication Services,Internet Content & Information
4,"Amazon.com, Inc.",1642000000000,AMZN,United States,Consumer Discretionary,Internet Retail

In [19]:
disfold_datasets[6].columns

Index(['name', 'code', 'rank', 'ceo', 'country', 'sector', 'industry',
       'headquarters', 'employees', 'founded', 'marketcap', 'revenue',
       'net income', 'link'],
      dtype='object')

In [20]:
disfold_datasets[6].rename(columns={'founded': 'founded_year',
                    'marketcap': 'market_cap',
                    'employees': 'number_of_employees',
                    'code': 'stock'}, inplace = True)
disfold_datasets[6].head(5)

,name,stock,rank,ceo,country,sector,industry,headquarters,number_of_employees,founded_year,market_cap,revenue,net income,link
0,Apple,AAPL,1,Mr. Timothy D. Cook,United States,Technology,Consumer Electronics,"Cupertino, CA, United States","100,000","April 1, 1976",$2.825 Trillion,US$365.82 billion (2021),US$94.68 billion (2021),"[https://www.apple.com, https://www.facebook.c..."
1,ExxonMobil,XOM,23,Mr. Darren W. Woods,United States,Energy,Oil & Gas Integrated,"Irving, TX, United States","63,000","November 30, 1999",$348.72 Billion,US$276.692 billion (2021),US$23.040 billion (2021),"[https://corporate.exxonmobil.com, https://en...."
2,Roche,ROG,22,Dr. Severin Schwan Ph.D.,Switzerland,Healthcare,Drug Manufacturers—General,"Basel, Switzerland","100,920",None,US$349.50 Billion,None,None,[https://www.roche.com]
3,Home Depot,HD,25,Mr. Edward P. Decker,United States,Consumer Discretionary,Home Improvement Retail,"Atlanta, GA, United States","490,600","February 6, 1978",$321.47 Billion,US$110.2 billion (2019),US$11.24 billion (2019),"[https://www.homedepot.com, https://en.wikiped..."
4,Pfizer,PFE,27,"Dr. Albert Bourla D.V.M., DVM, Ph.D.",United States,Healthcare,Drug Manufacturers—General,"New York, NY, United States","79,000",1849,$300.79 Billion,$41.908 billion (2020),$9.616 billion (2020),"[https://www.pfizer.com, https://www.facebook...."

In [21]:
disfold_datasets[7].columns

Index(['name', 'country', 'market_value_apr_2022', 'sector', 'stock'], dtype='object')

In [22]:
disfold_datasets[7].rename(columns={'market_value_apr_2022': 'market_cap'}, inplace = True)
disfold_datasets[7].head(5)

,name,country,market_cap,sector,stock
0,Apple Inc.,united states,$2.825 T,technology,AAPL
1,Microsoft Corporation,united states,$2.328 T,technology,MSFT
2,Saudi Arabian Oil Company,saudi arabia,$2.297 T,energy,2222
3,Alphabet Inc.,united states,$1.825 T,communication services,GOOG
4,"Amazon.com, Inc.",united states,$1.642 T,consumer discretionary,AMZN

In [23]:
disfold_datasets[8].columns

Index(['link', 'name', 'headquarters', 'employees', 'ceo', 'market_cap'], dtype='object')

In [24]:
disfold_datasets[8] = disfold_datasets[8].drop('link', axis = 1)
disfold_datasets[8].rename(columns={'employees': 'number_of_employees'}, inplace = True)
disfold_datasets[8].head(5)

,name,headquarters,number_of_employees,ceo,market_cap
0,Great Wall Motor Co Ltd,"Baoding, China","63,174",Not found,CN¥203.69 Billion
1,Colbún SA,"Santiago, Chile","1,193",Mr. Thomas Lippold Keller,CL$1.098 Trillion
2,Usinas Siderúrgicas de Minas Gerais SA,"Belo Horizonte, Brazil",Not found,Mr. Sergio Leite de Andrade,€3.54 Billion
3,Origin Enterprises plc,"Dublin, Ireland","2,641",Mr. Sean Gerard Coyle,€539.3 Million
4,Summit Real Estate Holdings Ltd,"Haifa, Israel",144,Mr. Amir Sagi,₪45.1 Million

In [25]:
disfold_merged = pd.merge(disfold_datasets[0], disfold_datasets[1], how = 'outer', on = None)
for i in range(2, len(disfold_datasets)):
  disfold_merged = pd.merge(disfold_merged, disfold_datasets[i], how = 'outer', on = None)

disfold_merged.columns

Index(['name', 'market_cap', 'stock', 'country', 'sector', 'industry',
       'headquarters', 'founded_year', 'number_of_employees', 'ceo',
       'top competitor', 'id', 'official_name', 'headquarters_country',
       'headquarters_continent', 'categories', 'gbp', 'rank', 'revenue',
       'net income', 'link'],
      dtype='object')

In [26]:
# Salva lo schema risultante
result_dis = disfold_merged.to_json(orient="records")

with open('schemaAlignment/disfold.json', 'w') as f:
    f.write(result_dis)

### **companiesMarketCap.com**

In [29]:
base_directory = 'de-sources-2022-2023/'
file_name = 'companiesmarketcap.com'
file_path = os.path.join(base_directory, file_name)

file_list = os.listdir(file_path)
print(file_list)

['avengers-companiesMarketCap.json', 'DDD-companiesmarketcap.com.csv', 'GioPonSpiz-companiesmarketcap.json', 'gren-companiesmarketcap.com.json', 'iGMM-companiesmarketcap.json', 'MalPatSaj-companiesmarketcap.com.xls', 'MarScoToc-companiesmarketcap.com.csv', 'wissel-aziende-companiesmarketcap.com.csv', 'wissel-categorie-companiesmarketcap.com.csv']

In [30]:
marketCap = [] #Mergio prima di tutti i dataset marketcap 

for i in file_list:
  if('market' in i or 'Market' in i):
    marketCap.append(i)

marketCap.sort()
print(marketCap)
len(marketCap)

['DDD-companiesmarketcap.com.csv', 'GioPonSpiz-companiesmarketcap.json', 'MalPatSaj-companiesmarketcap.com.xls', 'MarScoToc-companiesmarketcap.com.csv', 'avengers-companiesMarketCap.json', 'gren-companiesmarketcap.com.json', 'iGMM-companiesmarketcap.json', 'wissel-aziende-companiesmarketcap.com.csv', 'wissel-categorie-companiesmarketcap.com.csv']

9

In [31]:
from IPython.core.display import json
import pandas as pd

marketCap_datasets = []

for i in range(len(marketCap)):
  file_path_cmc = os.path.join(file_path, marketCap[i])
  if('.csv' in marketCap[i]):
    try:
      df = pd.read_csv(file_path_cmc)
    except:
      df = pd.read_csv(file_path_cmc, encoding = 'ISO-8859-1')
  if('.xlsx' in marketCap[i]):
    df = pd.read_excel(file_path_cmc)
  elif('.json' in marketCap[i]):
    try:
      df = pd.read_json(file_path_cmc)
    except:
      df = pd.read_json(file_path_cmc, lines= True)
  marketCap_datasets.append(df)

In [32]:
marketCap_datasets[0].columns
marketCap_datasets[0].head(1)

,Unnamed: 0,name,rank,marketcap,country,share_price,change1d,change1y,categories
0,0,Apple,1,$2.194 T,usa,$137.98,1.50%,-18.74%,tech software dow-jones tech-hardware electron...

In [33]:
marketCap_datasets[0] = marketCap_datasets[0].drop(['Unnamed: 0', 'change1d', 'change1y'], axis = 1)
marketCap_datasets[0].rename(columns={'marketcap': 'market_cap', 
                                      'share_price': 'price'}, inplace = True)

marketCap_datasets[0]['rank']=marketCap_datasets[0]['rank'].astype(object)
marketCap_datasets[0].columns

Index(['name', 'rank', 'market_cap', 'country', 'price', 'categories'], dtype='object')

In [34]:
marketCap_datasets[1].columns
marketCap_datasets[1].head(1)

    name codice  pricecap    price country
0  Apple   AAPL  $2.143 T  $134.76     USA

In [35]:
marketCap_datasets[1].rename(columns={'codice': 'stock',
                                      'pricecap': 'market_cap'}, inplace = True)
marketCap_datasets[1].head(5)

                name    stock market_cap    price    country
0              Apple     AAPL   $2.143 T  $134.76        USA
1       Saudi Aramco  2222.SR   $1.878 T    $8.54  S. Arabia
2          Microsoft     MSFT   $1.783 T  $239.23        USA
3  Alphabet (Google)     GOOG   $1.195 T   $92.80        USA
4             Amazon     AMZN   $1.000 T   $98.12        USA

In [36]:
marketCap_datasets[2].columns
marketCap_datasets[2].head(1)

    name stock market_cap    price country
0  Apple  AAPL   $2.143 T  $134.76     USA

In [37]:
marketCap_datasets[3].columns
marketCap_datasets[3].head(1)

    Name Master Cap Country Rank Share Price
0  Apple   $2.183 T     USA   #1     $137.87

In [38]:
marketCap_datasets[3].rename(columns={'Name': 'name',
                                      'Master Cap': 'market_cap',
                                      'Country': 'country',
                                      'Rank': 'rank',
                                      'Share Price': 'price'}, inplace = True)
marketCap_datasets[3]['rank']=marketCap_datasets[3]['rank'].str.replace('#', '')
marketCap_datasets[3].head(5)

                name market_cap       country rank    price
0              Apple   $2.183 T           USA    1  $137.87
1       Saudi Aramco   $1.887 T  Saudi Arabia    2    $8.58
2          Microsoft   $1.790 T           USA    3  $240.22
3  Alphabet (Google)   $1.278 T           USA    4   $99.28
4             Amazon  $992.11 B           USA    5   $97.25

In [39]:
marketCap_datasets[4].columns
marketCap_datasets[4].head(1)

,id,name,rank,market_cap,country,share_price,change_1_day,change_1_year,categories
0,1aeb78c70807445290795f145210a39e,Apple,1,$2.351 T,USA,$147.81,-0.34%,-9.74%,"[Tech, Software, Dow jones, Tech Hardware, Ele..."

In [40]:
marketCap_datasets[4] = marketCap_datasets[4].drop(['id', 'change_1_day', 'change_1_year', 'categories'], axis = 1)
marketCap_datasets[4].rename(columns={'share_price': 'price'}, inplace = True)
marketCap_datasets[4]['rank']=marketCap_datasets[4]['rank'].astype(object)
marketCap_datasets[4].head(5)

                   name rank market_cap country    price
0                 Apple    1   $2.351 T     USA  $147.81
1  Bristol-myers Squibb   57  $172.49 B     USA   $81.13
2           Wells Fargo   56  $175.05 B     USA   $45.94
3                  Nike   55  $175.54 B     USA  $112.20
4           Walt Disney   54  $177.08 B     USA   $99.43

In [41]:
marketCap_datasets[4].dtypes

name          object
rank          object
market_cap    object
country       object
price         object
dtype: object

In [42]:
marketCap_datasets[5].columns
marketCap_datasets[5].head(1)

    name market_capitalization_USD price country
0  Apple             2062000000000   130     USA

In [43]:
marketCap_datasets[5].rename(columns={'market_capitalization_USD': 'market_cap'}, inplace = True)
marketCap_datasets[5].head(5)

                name     market_cap price    country
0              Apple  2062000000000   130        USA
1       Saudi Aramco  1848000000000     8  S. Arabia
2          Microsoft  1676000000000   225        USA
3  Alphabet (Google)  1137000000000    88        USA
4             Amazon   878160000000    86        USA

In [44]:
marketCap_datasets[6].columns
marketCap_datasets[6].head(1)

,name,code,rank,marketcap,country,sharePrice,change(1day),change(1year),categories
0,Apple,AAPL,1,$2.242 T,USA,$140.94,-1.38%,-17.67%,"[Tech, Software, Dowjones, TechHardware, Elect..."

In [45]:
marketCap_datasets[6] = marketCap_datasets[6].drop(['change(1day)', 'change(1year)', 'categories'], axis = 1)
marketCap_datasets[6].rename(columns={'code': 'stock',
                                      'marketcap': 'market_cap',
                                      'sharePrice': 'price'}, inplace = True)

marketCap_datasets[6]['rank']=marketCap_datasets[6]['rank'].astype(object)
marketCap_datasets[6].columns

Index(['name', 'stock', 'rank', 'market_cap', 'country', 'price'], dtype='object')

In [46]:
marketCap_datasets[7].columns
marketCap_datasets[7].head(1)

,Unnamed: 0,URL,ID,Name,Company code,Marketcap,Share price,Earnings,Revenue,Shares,Employees
0,0,https://companiesmarketcap.com/vertex-pharmace...,1.0,Vertex Pharmaceuticals,VRTX,$77.24 B,$300.94,$4.08 B,$8.70 B,256.500.000,3.9

In [47]:
marketCap_datasets[7] = marketCap_datasets[7].drop(['Unnamed: 0', 'ID', 'Shares', 'URL'], axis = 1)
marketCap_datasets[7].rename(columns={'Name': 'name',
                                      'Company code': 'stock',
                                      'Marketcap': 'market_cap',
                                      'Share price': 'price',
                                      'Earnings': 'net_income',
                                      'Revenue': 'revenue',
                                      'Employees': 'number_of_employees'}, inplace = True)
marketCap_datasets[7].head(5)

,name,stock,market_cap,price,net_income,revenue,number_of_employees
0,Vertex Pharmaceuticals,VRTX,$77.24 B,$300.94,$4.08 B,$8.70 B,3.9
1,Verano Holdings,VRNOF,$0.97 B,$3.00,-$62.2 M,$0.81 B,3.888
2,AZZ,AZZ,$1.09 B,$43.85,$0.12 B,$1.17 B,3.885
3,F.N.B. Corporation,FNB,$4.83 B,$13.41,$0.50 B,$1.33 B,3.884
4,Quanex Building Products,NX,$0.82 B,$24.96,$0.10 B,$1.22 B,3.86

In [48]:
marketCap_datasets[8].columns

Index(['Company ID', 'Category', 'Hash'], dtype='object')

In [49]:
marketCap_datasets[8].drop(['Company ID', 'Category', 'Hash'], axis = 1) #Questo dataset è inutile
marketCap_datasets.pop()

      Company ID                 Category                 Hash
0              1                   Retail  2932210656109287952
1              1                 Dowjones -3512652547975320346
2              1        SupermarketChains -4069439822336842578
3              2                ECommerce  5458971525214020641
4              2                 Internet  -848597773130649638
...          ...                      ...                  ...
1818        1397               MediaPress -6159643471181631199
1819        1399                   OilGas  7683904390150838630
1820        1399  OilGasEquipmentServices -5823085833726200737
1821        1399                   Energy -2882595272621617431
1822        1400        Telecommunication -3862064693147789081

[1823 rows x 3 columns]

In [51]:
companiesMarketCap_merged = pd.merge(marketCap_datasets[0], marketCap_datasets[1], how = 'outer', on = None)
for i in range(2, len(marketCap_datasets)):
  companiesMarketCap_merged = pd.merge(companiesMarketCap_merged, marketCap_datasets[i], how = 'outer', on = None)

companiesMarketCap_merged

,name,rank,market_cap,country,price,categories,stock,net_income,revenue,number_of_employees
0,Apple,1.0,$2.194 T,usa,$137.98,tech software dow-jones tech-hardware electron...,NaN,NaN,NaN,NaN
1,Unilever,99.0,$129.09 B,united-kingdom,$50.98,food consumer-goods,NaN,NaN,NaN,NaN
2,AIA,97.0,$130.12 B,hong-kong,$11.11,insurance,NaN,NaN,NaN,NaN
3,Lowe's Companies,100.0,$128.96 B,usa,$213.26,retail,NaN,NaN,NaN,NaN
4,RWE,601.0,$30.02 B,germany,$44.41,electricity dax energy,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
43647,Accolade,NaN,$0.64 B,NaN,$9.03,NaN,ACCD,-$0.4 B,$0.35 B,2.350
43648,Townsquare Media,NaN,$0.12 B,NaN,$7.37,NaN,TSQ,$70.45 M,$0.44 B,2.340
43649,NETSCOUT,NaN,$2.73 B,NaN,$37.80,NaN,NTCT,$62.63 M,$0.89 B,2.308
43650,NOW Inc.,NaN,$1.37 B,NaN,$12.49,NaN,DNOW,$0.11 B,$2.02 B,2.300
43651,ATN International,NaN,$0.76 B,NaN,$48.53,NaN,ATNI,-$13.66 M,$0.72 B,2.300

In [52]:
# Salva il dataset risultante
result_cmc = companiesMarketCap_merged.to_json(orient="records")

with open('schemaAlignment/companiesMarketCap.json', 'w') as f:
    f.write(result_cmc)

### **cbinsight.com**

In [ ]:
# Da eseguire una volta

# Leggi il dataset da convertire
cbi1 = pd.read_csv("de-sources-2022-2023/cbinsight.com/DDD-cbinsight.com.csv")

# Conversione file .csv in .json
cbi1_json = cbi1.to_json(orient="records")

# Salva il file nella cartella cbinsight.com
with open('de-sources-2022-2023/cbinsight.com/DDD-cbinsight.com.json', 'w') as f:
    f.write(cbi1_json)

In [2]:
cbi1 = pd.read_json("de-sources-2022-2023/cbinsight.com/DDD-cbinsight.com.json")
cbi1.head()

,Unnamed: 0,name,valuation,dateJoined,country,city,industry,investors,founded,stage,totalRaised
0,0,Lacework,$8.3B,1/7/2021,United States,San Jose,Cybersecurity,"Sutter Hill Ventures, Liberty Global Ventures,...",2015,Series E,$1.907B
1,1,Tipalti,$8.3B,10/6/2020,United States,San Mateo,Fintech,"01 Advisors, Zeev Ventures, Group 11",2010,Series F,$556M
2,2,Tempus,$8.1B,3/21/2018,United States,Chicago,Health,"New Enterprise Associates, T. Rowe Associates,...",2015,Unattributed - II,$1.345B
3,3,Anduril,$8.48B,9/11/2019,United States,Irvine,Artificial intelligence,"Andreessen Horowitz, Founders Fund, Revolution...",2017,Series E,$2.309B
4,4,Bolt,$8.4B,5/29/2018,Estonia,Tallinn,Auto & transportation,"Didi Chuxing, Diamler, TMT Investments",2013,Series F,$1.971B

In [3]:
cbi1.drop("Unnamed: 0", axis=1, inplace=True)
cbi1.head()

,name,valuation,dateJoined,country,city,industry,investors,founded,stage,totalRaised
0,Lacework,$8.3B,1/7/2021,United States,San Jose,Cybersecurity,"Sutter Hill Ventures, Liberty Global Ventures,...",2015,Series E,$1.907B
1,Tipalti,$8.3B,10/6/2020,United States,San Mateo,Fintech,"01 Advisors, Zeev Ventures, Group 11",2010,Series F,$556M
2,Tempus,$8.1B,3/21/2018,United States,Chicago,Health,"New Enterprise Associates, T. Rowe Associates,...",2015,Unattributed - II,$1.345B
3,Anduril,$8.48B,9/11/2019,United States,Irvine,Artificial intelligence,"Andreessen Horowitz, Founders Fund, Revolution...",2017,Series E,$2.309B
4,Bolt,$8.4B,5/29/2018,Estonia,Tallinn,Auto & transportation,"Didi Chuxing, Diamler, TMT Investments",2013,Series F,$1.971B

In [12]:
cbi2 = pd.read_json('de-sources-2022-2023/cbinsight.com/iGMM-cbinsights.json')
cbi2.head()

,company,valuation,datejoined,country,city,industry,selectinvestors
0,ByteDance,$140,4/7/2017,China,Beijing,Artificial intelligence,"Sequoia Capital China, SIG Asia Investments, S..."
1,SpaceX,$127,12/1/2012,United States,Hawthorne,Other,"Founders Fund, Draper Fisher Jurvetson, Rothen..."
2,SHEIN,$100,7/3/2018,China,Shenzhen,E-commerce & direct-to-consumer,"Tiger Global Management, Sequoia Capital China..."
3,Stripe,$95,1/23/2014,United States,San Francisco,Fintech,"Khosla Ventures, LowercaseCapital, capitalG"
4,Canva,$40,1/8/2018,Australia,Surry Hills,Internet software & services,"Sequoia Capital China, Blackbird Ventures, Mat..."

In [13]:
# Rinomina le colonne con gli stessi nomi in entrambi i dataframe
cbi2 = cbi2.rename(columns={"company": "name", "datejoined": "dateJoined", "selectinvestors": "investors"})

In [14]:
# Unisci i dataframe
result_cbinsight = pd.concat([cbi1, cbi2], ignore_index=True)
result_cbinsight.head(10)

,name,valuation,dateJoined,country,city,industry,investors,founded,stage,totalRaised
0,Lacework,$8.3B,1/7/2021,United States,San Jose,Cybersecurity,"Sutter Hill Ventures, Liberty Global Ventures,...",2015,Series E,$1.907B
1,Tipalti,$8.3B,10/6/2020,United States,San Mateo,Fintech,"01 Advisors, Zeev Ventures, Group 11",2010,Series F,$556M
2,Tempus,$8.1B,3/21/2018,United States,Chicago,Health,"New Enterprise Associates, T. Rowe Associates,...",2015,Unattributed - II,$1.345B
3,Anduril,$8.48B,9/11/2019,United States,Irvine,Artificial intelligence,"Andreessen Horowitz, Founders Fund, Revolution...",2017,Series E,$2.309B
4,Bolt,$8.4B,5/29/2018,Estonia,Tallinn,Auto & transportation,"Didi Chuxing, Diamler, TMT Investments",2013,Series F,$1.971B
5,ByteDance,$140B,4/7/2017,China,Beijing,Artificial intelligence,"Sequoia Capital China, SIG Asia Investments, S...",2012,Private Equity,$7.44B
6,Niantic,$9B,11/24/2017,United States,San Francisco,Mobile & telecommunications,"Nintendo, Google, Pokemon Company Internationa...",2015,Series D,$770M
7,OYO Rooms,$9B,9/25/2018,India,Gurugram,Travel,"SoftBank Group, Sequoia Capital India,Lightspe...",2012,Secondary Market,$3.114B
8,Kavak,$8.7B,10/1/2020,Mexico,Lerma de Villada,E-commerce & direct-to-consumer,"DST Global, SoftBank Group, Mountain Nazca",2014,Line of Credit - II,$2.702B
9,Personio,$8.5B,1/19/2021,Germany,Munich,Internet software & services,"Global Founders Capital, Nortzone Ventures, Pi...",2015,Series E - II,$724.83M

In [17]:
# Salva lo schema risultante
result_cbinsight= result_cbinsight.to_json(orient="records")

with open('schemaAlignment/cbinsight.json', 'w') as f:
    f.write(result_cbinsight)

### **value.today**

In [29]:
# Da eseguire una volta

# Leggi dataset da convertire
val1 = pd.read_csv('de-sources-2022-2023/value.today/FR-valuetoday.csv')
val6 = pd.read_csv('de-sources-2022-2023/value.today/silvestri-value.today.csv')

# Conversione file .csv in .json
val1_json = val1.to_json(orient="records")
val6_json = val6.to_json(orient="records")

# Salva il file nella cartella value.today
with open('de-sources-2022-2023/value.today/FR-valuetoday.json', 'w') as f:
    f.write(val1_json) 

with open('de-sources-2022-2023/value.today/silvestri-value.today.json', 'w') as f:
    f.write(val6_json)

In [2]:
val1 = pd.read_json('de-sources-2022-2023/value.today/FR-valuetoday.json')
val1.head(1)

,IPO Year,Number of Employees,Country,CEO,Founded Year,Market Value,Name
0,1980.0,"154,000",USA,Tim Cook,1976.0,"2,825.00 Billion USD",APPLE

In [3]:
val2 = pd.read_json('de-sources-2022-2023/value.today/GioPonSpiz-value.today.json')
val2.head(1)

,name,world_rank,marketValue,marketCap,CEO,country
0,APPLE,1,"2,825.000 Billion USD","2,510.000 Billion USD",Tim Cook,USA

In [82]:
val3 = pd.read_json('de-sources-2022-2023/value.today/avengers-valuetoday.json', lines=True)
val3.head(1)

,id,name,world_rank,annual_revenue_in_usd,annual_net_income_in_usd,annual_results_for_year_ending,total_assets_in_usd,total_liabilities_in_usd,total_equity_in_usd,headquarters_region_city,headquarters_country,headquarters_sub_region,headquarters_continent,company_business,number_of_employees,ceo,founders,company_website
0,b9a098214d1a4ce1acc834cf17aef660,Apple,1,"394,330 Million USD","99,803 Million USD",Sep-2022,"352,760 Million USD","302,080 Million USD","50,672 Million USD",California,USA,Northern America,Americas,"[Technology, Mobiles & Accessories, Electronic...","154,000",Tim Cook,"[Steve Jobs, Steve Wozniak, Ronald Wayne]",https://www.apple.com/

In [88]:
val4 = pd.read_json('de-sources-2022-2023/value.today/gren-value.today.json')
val4.head(1)

,name,annual_revenue_USD,annual_net_income_USD,market_capitalization_2022,employees_number,CEO,headquarters_country,wikipedia_page_url,twitter_page_url,facebook_page_url
0,APPLE,394330000000,99803000000,2825000000000,154000,Tim Cook,USA,https://en.wikipedia.org/wiki/Apple_Inc.,https://twitter.com/apple?lang=en,https://www.facebook.com/apple/

In [70]:
val5 = pd.read_json('de-sources-2022-2023/value.today/iGMM-value.today.json')
val5.head(1)

,name,ceo,market value (Jan-07-2022),world rank (Jan-07-2022),market value (Jan 1st 2020),world rank (Jan-2020),headquarters country,number of employees,company business,annual revenue in USD,annual net income in USD,company website
0,APPLE,Tim Cook,"2,825.000 Billion USD",1,"1,323.000 Billion USD",2.0,USA,"154,000","[Technology, Mobiles & Accessories, Electronics]","365,820 Million USD","94,680 Million USD",https://www.apple.com/

In [7]:
val6 = pd.read_json('de-sources-2022-2023/value.today/silvestri-value.today.json')
val6.head(1)

,ceo,country,market_value_jan_2020,market_value_jan_2021,market_value_jan_2022,name,employees_2022,revenue_2022,sector
0,Bernard Arnault,france,237.807 Billion USD,313.500 Billion USD,409.480 Billion USD,lvmh,"150,000","70,765 Million USD",fashion and luxury goods

In [8]:
val7 = pd.read_json('de-sources-2022-2023/value.today/slytherin-value.today.json')
val7.head(1)

,link,rank,name,ceo,founded,revenue,country,industry
0,https://www.value.today/company/apple,1,APPLE,Tim Cook,1976,"365,820 Million USD",USA,"[Technology, Mobiles & Accessories, Electronic..."

In [68]:
val1 = val1.rename(columns={'IPO Year':'ipo_year', 'Number of Employees':'number_of_employees', 'Country':'country', 'CEO':'ceo', 'Founded Year':'founded_year', 'Market Value':'market_value', 'Name':'name'})

val1_toDrop = ['ipo_year', 'founded_year']
val1 = val1.drop(val1_toDrop, axis=1)

val1.head()

,number_of_employees,country,ceo,market_value,name
0,"154,000",USA,Tim Cook,"2,825.00 Billion USD",APPLE
1,"220,000",USA,Satya Nadella,"2,358.00 Billion USD",MICROSOFT CORPORATION
2,"79,800",Saudi Arabia,Amin H. Al-Nasser,"1,889.60 Billion USD",SAUDI ARABIAN OIL COMPANY (Saudi Aramco)
3,"156,500",USA,Sundar Pichai,"1,820.00 Billion USD",ALPHABET
4,"1,335,000",USA,Andy Jassy,"1,649.00 Billion USD",AMAZON.COM

In [66]:
val2 = val2.rename(columns={'marketValue':'market_value', 'marketCap':'market_cap', 'CEO':'ceo'})

val2_toDrop = ['world_rank']
val2 = val2.drop(val2_toDrop, axis=1)

val2.head()

,name,market_value,market_cap,ceo,country
0,APPLE,"2,825.000 Billion USD","2,510.000 Billion USD",Tim Cook,USA
1,MICROSOFT CORPORATION,"2,358.000 Billion USD","2,269.000 Billion USD",None,USA
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),"1,889.600 Billion USD","1,891.600 Billion USD",H.E. Yasir Othman Al-Rumayyan,Saudi Arabia
3,ALPHABET,"1,820.000 Billion USD","1,934.000 Billion USD",John L. Hennessy,USA
4,AMAZON.COM,"1,649.000 Billion USD","1,758.000 Billion USD",Andy Jassy,USA

In [83]:
val3 = val3.rename(columns={'headquarters_country':'country', 'company_business':'industry'})

val3_toDrop = ['id', 'world_rank','annual_results_for_year_ending', 'total_assets_in_usd', 'total_liabilities_in_usd', 'total_equity_in_usd', 'headquarters_region_city', 'headquarters_sub_region', 'headquarters_continent', 'annual_revenue_in_usd', 'annual_net_income_in_usd']
val3 = val3.drop(val3_toDrop, axis=1)

val3.head()

,name,country,industry,number_of_employees,ceo,founders,company_website
0,Apple,USA,"[Technology, Mobiles & Accessories, Electronic...","154,000",Tim Cook,"[Steve Jobs, Steve Wozniak, Ronald Wayne]",https://www.apple.com/
1,Taiwan Semiconductor Manufacturing Company (tsmc),Taiwan,"[Technology, Semiconductors, Electronics, Tech...","65,152",C. C. Wei,Morris Chang,https://www.tsmc.com/
2,Nvidia Corporation,USA,"[Technology, Semiconductors, Electronics, Tech...","18,975",Jensen Huang,"[Jensen Huang, Chris Malachowsky, Curtis Priem]",http://www.nvidia.com/
3,Berkshire Hathaway,USA,"[Financial Services, Investments, Insurance]","372,000",Warren Buffett,Oliver Chace,https://www.berkshirehathaway.com/
4,Meta Platforms,USA,"[Communication Services, Internet or Mobile Ap...","77,805",Mark Zuckerberg,"[Mark Zuckerberg, Andrew McCollum, Eduardo Sav...",https://www.facebook.com/

In [89]:
val4 = val4.rename(columns={'market_capitalization_2022':'market_value', 'annual_revenue_USD':'annual_revenue_in_usd','annual_net_in_usd':'annual_net_income_in_usd','employees_number':'number_of_employees', 'CEO':'ceo', 'headquarters_country':'country'})

val4_toDrop = ['wikipedia_page_url', 'twitter_page_url','facebook_page_url', 'annual_revenue_in_usd', 'annual_net_income_USD']
val4 = val4.drop(val4_toDrop, axis=1)

val4.head()

,name,market_value,number_of_employees,ceo,country
0,APPLE,2825000000000,154000,Tim Cook,USA
1,MICROSOFT CORPORATION,2358000000000,220000,Satya Nadella,USA
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),1889600000000,79800,Amin H. Al-Nasser,Saudi Arabia
3,ALPHABET,1820000000000,156500,Sundar Pichai,USA
4,AMAZON.COM,1649000000000,1335000,Andy Jassy,USA

In [71]:
val5 = val5.rename(columns={'market value (Jan-07-2022)':'market_value', 'world rank (Jan-07-2022)':'world_rank', 'market value (Jan 1st 2020)':'market_value_01_2020', 'world rank (Jan-2020)':'world_rank_01_2020', 'headquarters country':'country', 'number of employees':'number_of_employees', 'company business':'industry', 'annual revenue in USD':'annual_revenue_USD', 'annual net income in USD':'annual_net_income_USD', 'company website':'company_website'})

val5_toDrop = ['world_rank', 'market_value_01_2020','world_rank_01_2020', 'annual_revenue_USD', 'annual_net_income_USD']
val5 = val5.drop(val5_toDrop, axis=1)

val5.head()

,name,ceo,market_value,country,number_of_employees,industry,company_website
0,APPLE,Tim Cook,"2,825.000 Billion USD",USA,"154,000","[Technology, Mobiles & Accessories, Electronics]",https://www.apple.com/
1,MICROSOFT CORPORATION,Satya Nadella,"2,358.000 Billion USD",USA,"220,000","[Technology, Software and IT, Laptops]",https://www.microsoft.com/
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),Amin H. Al-Nasser,"1,889.600 Billion USD",Saudi Arabia,"79,800","[Energy, Oil and Gas, Chemicals]",https://www.saudiaramco.com/
3,ALPHABET,Sundar Pichai,"1,820.000 Billion USD",USA,"156,500","[Technology, Internet or Mobile App Based Busi...",https://abc.xyz/
4,AMAZON.COM,Andy Jassy,"1,649.000 Billion USD",USA,"1,335,000","[eCommerce, Internet or Mobile App Based Busin...",https://www.amazon.com/

In [58]:
val6 = val6.rename(columns={'market_value_jan_2020':'market_value_01_2020', 'market_value_jan_2021':'market_value_01_2021', 'market_value_jan_2022':'market_value', 'employees_2022':'number_of_employees', 'revenue_2022':'revenue', 'sector':'sector'})

val6_toDrop = ['market_value_01_2020', 'market_value_01_2021', 'sector']
val6 = val6.drop(val6_toDrop, axis=1)

val6.head()

,ceo,country,market_value,name,number_of_employees,revenue
0,Bernard Arnault,france,409.480 Billion USD,lvmh,"150,000","70,765 Million USD"
1,Ulf Mark Schneider,switzerland,372.720 Billion USD,nestle ag,"276,000","92,575 Million USD"
2,Severin Schwan,switzerland,356.150 Billion USD,roche holding ag,"100,920","66,757 Million USD"
3,Peter Wennink,netherlands,307.330 Billion USD,asml holding,"28,000","20,509 Million USD"
4,Bob van Dijk,netherlands,254.550 Billion USD,prosus,"23,874","6,866 Million USD"

In [60]:
val7 = val7.rename(columns={'link':'company_website', 'rank':'rank', 'founded':'founded_year', 'revenue':'revenue'})

val7_toDrop = ['rank']
val7 = val7.drop(val7_toDrop, axis=1)

val7.head()

,company_website,name,ceo,founded_year,revenue,country,industry
0,https://www.value.today/company/apple,APPLE,Tim Cook,1976,"365,820 Million USD",USA,"[Technology, Mobiles & Accessories, Electronic..."
1,https://www.value.today/company/taiwan-semicon...,TAIWAN SEMICONDUCTOR MANUFACTURING COMPANY (TSMC),Mark Liu,1987,"55,306 Million USD",Taiwan,"[Technology, Semiconductors, Electronics, Tech..."
2,https://www.value.today/company/microsoft-corp...,MICROSOFT CORPORATION,Satya Nadella,1975,"198,270 Million USD",USA,"[Technology, Software and IT, Laptops, Video G..."
3,https://www.value.today/company/nvidia-corpora...,NVIDIA CORPORATION,Jensen Huang,1993,"26,914 Million USD",USA,"[Technology, Semiconductors, Electronics, Tech..."
4,https://www.value.today/company/amazon.com,AMAZON.COM,Andy Jassy,1994,"469,820 Million USD",USA,"[eCommerce, Internet or Mobile App Based Busin..."

In [93]:
merged_valueToday = pd.merge(val1, val2, on='name', how='outer')
merged_valueToday = pd.merge(merged_valueToday, val3, on='name', how='outer')
merged_valueToday = pd.merge(merged_valueToday, val4, on='name', how='outer')
merged_valueToday = pd.merge(merged_valueToday, val5, on='name', how='outer')
merged_valueToday = pd.merge(merged_valueToday, val6, on='name', how='outer')
merged_valueToday = pd.merge(merged_valueToday, val7, on='name', how='outer')

In [94]:
merged_valueToday = val1.combine_first(val2)
merged_valueToday = merged_valueToday.combine_first(val3)
merged_valueToday = merged_valueToday.combine_first(val4)
merged_valueToday = merged_valueToday.combine_first(val5)
merged_valueToday = merged_valueToday.combine_first(val6)
merged_valueToday = merged_valueToday.combine_first(val7)

In [95]:
merged_valueToday.head()

,ceo,company_website,country,founded_year,founders,industry,market_cap,market_value,name,number_of_employees,revenue
0,Tim Cook,https://www.apple.com/,USA,1976,"[Steve Jobs, Steve Wozniak, Ronald Wayne]","[Technology, Mobiles & Accessories, Electronic...","2,510.000 Billion USD","2,825.00 Billion USD",APPLE,"154,000","70,765 Million USD"
1,Satya Nadella,https://www.tsmc.com/,USA,1987,Morris Chang,"[Technology, Semiconductors, Electronics, Tech...","2,269.000 Billion USD","2,358.00 Billion USD",MICROSOFT CORPORATION,"220,000","92,575 Million USD"
2,Amin H. Al-Nasser,http://www.nvidia.com/,Saudi Arabia,1975,"[Jensen Huang, Chris Malachowsky, Curtis Priem]","[Technology, Semiconductors, Electronics, Tech...","1,891.600 Billion USD","1,889.60 Billion USD",SAUDI ARABIAN OIL COMPANY (Saudi Aramco),"79,800","66,757 Million USD"
3,Sundar Pichai,https://www.berkshirehathaway.com/,USA,1993,Oliver Chace,"[Financial Services, Investments, Insurance]","1,934.000 Billion USD","1,820.00 Billion USD",ALPHABET,"156,500","20,509 Million USD"
4,Andy Jassy,https://www.facebook.com/,USA,1994,"[Mark Zuckerberg, Andrew McCollum, Eduardo Sav...","[Communication Services, Internet or Mobile Ap...","1,758.000 Billion USD","1,649.00 Billion USD",AMAZON.COM,"1,335,000","6,866 Million USD"

In [96]:
# Salva lo schema risultante
result_valueToday = merged_valueToday.to_json(orient="records")

with open('schemaAlignment/valueToday.json', 'w') as f:
    f.write(result_valueToday)

In [98]:
num_aziende = merged_valueToday['name']
np.size(num_aziende)

10682

### **forbes.com**

In [111]:
# Da eseguire una volta

# Leggi dataset da convertire
for1 = pd.read_csv('de-sources-2022-2023/forbes.com/FR-forbes.csv')
for2 = pd.read_csv('de-sources-2022-2023/forbes.com/silvestri-forbes.com.csv')
for3 = pd.read_excel('de-sources-2022-2023/forbes.com/MalPatSaj-forbes.com.xls')

# Conversione file .csv in .json
for1_json = for1.to_json(orient="records")
for2_json = for2.to_json(orient="records")
for3_json = for3.to_json(orient="records")

# Salva il file nella cartella value.today
with open('de-sources-2022-2023/forbes.com/FR-forbes.json', 'w') as f:
    f.write(for1_json) 

with open('de-sources-2022-2023/forbes.com/silvestri-forbes.com.json', 'w') as f:
    f.write(for2_json) 

with open('de-sources-2022-2023/forbes.com/MalPatSaj-forbes.com.json', 'w') as f:
    f.write(for3_json)

In [101]:
for1 = pd.read_json('de-sources-2022-2023/forbes.com/FR-forbes.json')
for1.head(1)

,Industry,Founded,Revenue,Name,Location
0,Diversified Financials,1939.0,$276.1B,Berkshire Hathaway,"Omaha, Nebraska"

In [112]:
for2 = pd.read_json('de-sources-2022-2023/forbes.com/silvestri-forbes.com.json')
for2.head(1)

         country market_value_apr_2022                name revenue_2022
0  united states             $741.48 B  berkshire hathaway    $276.09 B

In [102]:
for3 = pd.read_json('de-sources-2022-2023/forbes.com/MalPatSaj-forbes.com.json')
for3.head(1)

,Unnamed: 0,Name,Country,Sales,Profit,Assets,Market Value
0,0,Berkshire Hathaway,United States,$276.09 B,$89.8 B,$958.78 B,$741.48 B

In [106]:
for4 = pd.read_json('de-sources-2022-2023/forbes.com/slytherin-forbes.com.json')
for4.head(1)

,link,name,industry,founded,country,ceo,employees,revenue
0,https://www.forbes.com/companies/berkshire-hat...,Berkshire Hathaway,Diversified Financials,1939,United States,Warren Edward Buffett,"372,000",$276.1B

In [119]:
for1 = for1.rename(columns={'Name':'name', 'Industry':'industry', 'Founded':'founded', 'Revenue': 'revenue'})

for1_toDrop = ['Location']
for1 = for1.drop(for1_toDrop, axis=1)

for1.head()

,industry,founded,revenue,name
0,Diversified Financials,1939.0,$276.1B,Berkshire Hathaway
1,Banking,1984.0,$208.1B,ICBC
2,Oil & Gas Operations,1933.0,$400.4B,Saudi Arabian Oil Company (Saudi Aramco)
3,Banking and Financial Services,2000.0,$124.5B,JPMorgan Chase
4,Banking,2014.0,$202.1B,China Construction Bank

In [120]:
for2 = for2.rename(columns={'market_value_apr_2022':'market_value', 'revenue_2022':'revenue'})

for2.head()

,country,market_value,name,revenue
0,united states,$741.48 B,berkshire hathaway,$276.09 B
1,china,$214.43 B,icbc,$208.13 B
2,saudi arabia,"$2,292.08 B",saudi arabian oil company (saudi aramco),$400.38 B
3,united states,$374.45 B,jpmorgan chase,$124.54 B
4,china,$181.32 B,china construction bank,$202.07 B

In [123]:
for3 = for3.rename(columns={'Name':'name', 'Country':'country', 'Market Value':'market_value', 'Sales': 'revenue'})

for3_toDrop = ['Unnamed: 0', 'Profit', 'Assets']
for3 = for3.drop(for3_toDrop, axis=1)

for3.head()

,name,country,revenue,market_value
0,Berkshire Hathaway,United States,$276.09 B,$741.48 B
1,ICBC,China,$208.13 B,$214.43 B
2,Saudi Arabian Oil Company (Saudi Aramco),Saudi Arabia,$400.38 B,"$2,292.08 B"
3,JPMorgan Chase,United States,$124.54 B,$374.45 B
4,China Construction Bank,China,$202.07 B,$181.32 B

In [124]:
for4 = for4.rename(columns={'link':'company_website', 'employees':'number_of_employees'})

for4.head()

,company_website,name,industry,founded,country,ceo,number_of_employees,revenue
0,https://www.forbes.com/companies/berkshire-hat...,Berkshire Hathaway,Diversified Financials,1939,United States,Warren Edward Buffett,"372,000",$276.1B
1,https://www.forbes.com/companies/icbc,ICBC,Banking,1984,China,Shu Gu,"434,089",$208.1B
2,https://www.forbes.com/companies/saudi-arabian...,Saudi Arabian Oil Company (Saudi Aramco),Oil & Gas Operations,1933,Saudi Arabia,Amin bin Hasan Al-Nasser,"68,493",$400.4B
3,https://www.forbes.com/companies/jpmorgan-chase,JPMorgan Chase,Banking and Financial Services,2000,United States,Jamie Dimon,"270,000",$124.5B
4,https://www.forbes.com/companies/china-constru...,China Construction Bank,Banking,2014,China,Wang Zuji,"349,671",$202.1B

In [126]:
merged_forbes = pd.merge(for1, for2, on='name', how='outer')
merged_forbes = pd.merge(merged_forbes, for3, on='name', how='outer')
merged_forbes = pd.merge(merged_forbes, for4, on='name', how='outer')

In [127]:
merged_forbes = for1.combine_first(for2)
merged_forbes = merged_forbes.combine_first(for3)
merged_forbes = merged_forbes.combine_first(for4)

In [128]:
merged_forbes.head()

,ceo,company_website,country,founded,industry,market_value,name,number_of_employees,revenue
0,Warren Edward Buffett,https://www.forbes.com/companies/berkshire-hat...,united states,1939.0,Diversified Financials,$741.48 B,Berkshire Hathaway,"372,000",$276.1B
1,Shu Gu,https://www.forbes.com/companies/icbc,china,1984.0,Banking,$214.43 B,ICBC,"434,089",$208.1B
2,Amin bin Hasan Al-Nasser,https://www.forbes.com/companies/saudi-arabian...,saudi arabia,1933.0,Oil & Gas Operations,"$2,292.08 B",Saudi Arabian Oil Company (Saudi Aramco),"68,493",$400.4B
3,Jamie Dimon,https://www.forbes.com/companies/jpmorgan-chase,united states,2000.0,Banking and Financial Services,$374.45 B,JPMorgan Chase,"270,000",$124.5B
4,Wang Zuji,https://www.forbes.com/companies/china-constru...,china,2014.0,Banking,$181.32 B,China Construction Bank,"349,671",$202.1B

In [129]:
# Salva lo schema risultante
result_forbes = merged_forbes.to_json(orient="records")

with open('schemaAlignment/forbes.json', 'w') as f:
    f.write(result_forbes)

### **ft.com**

In [3]:
# Da eseguire una volta

# Leggi dataset da convertire
ft1 = pd.read_csv('de-sources-2022-2023/ft.com/DDD-ft.com.csv')
ft2 = pd.read_csv('de-sources-2022-2023/ft.com/FR-ft.csv')
ft3 = pd.read_csv('de-sources-2022-2023/ft.com/silvestri-ft.com.csv')

# Conversione file .csv in .json
ft1_json = ft1.to_json(orient="records")
ft2_json = ft2.to_json(orient="records")
ft3_json = ft3.to_json(orient="records")

# Salva il file nella cartella value.today
with open('de-sources-2022-2023/ft.com/DDD-ft.com.json', 'w') as f:
    f.write(ft1_json) 

with open('de-sources-2022-2023/ft.com/FR-ft.json', 'w') as f:
    f.write(ft2_json) 

with open('de-sources-2022-2023/ft.com/silvestri-ft.com.json', 'w') as f:
    f.write(ft3_json)

In [4]:
ft1 = pd.read_json('de-sources-2022-2023/ft.com/DDD-ft.com.json')
ft1.head(1)

,Unnamed: 0,name,country,sector,absolute_growth_rate_pct,compound_annual_growth_rate_cagr_pct,revenue_2020_euro,revenue_2017_euro,number_of_employees_2020,number_of_employees_2017,founding_year
0,0,Swappie,Finland,Technology,"19,152.82",477.43,"97,611,814","507,000",218,1,2016

In [5]:
ft2 = pd.read_json('de-sources-2022-2023/ft.com/FR-ft.json')
ft2.head(1)

,Rank,Name,in 2021 ranking,in 2020 ranking,Country,Sector,Absolute Growth Rate %,Compound Annual Growth Rate (CAGR) %,Revenue 2020 (€),Revenue 2017 (€),Number of employees 2020,Number of employees 2017,Founding Year
0,1,Swappie,No,No,Finland,Technology,"19,152.82",477.43,"97,611,814","507,000",218.0,1,2016

In [6]:
ft3 = pd.read_json('de-sources-2022-2023/ft.com/silvestri-ft.com.json')
ft3.head(1)

,country,employees_2017,employees_2020,founding_year,name,revenue_2017,revenue_2020,sector
0,finland,1,218.0,2016,swappie,"507,000","97,611,814",technology

In [7]:
ft4 = pd.read_json('de-sources-2022-2023/ft.com/gren-ft.com.json')
ft4.head(1)

,name,country,sector,revenue_2020_EU,revenue_2017_EU,employees_number_2020,employees_number_2017,founding_year
0,Swappie,Finland,Technology,97611814,507000,218,1,2016

In [8]:
ft5 = pd.read_json('de-sources-2022-2023/ft.com/slytherin-ft.com.json')
ft5.head(1)

,link,name,country,industry,revenue,employees,founded
0,https://www.greatdealscorp.com/,Great Deals E-Commerce Corp.,Philippines,Ecommerce,88.77,385,2017

In [9]:
ft1 = ft1.rename(columns={'Name':'name', 'revenue_2020_euro': 'revenue_2020', 'revenue_2017_euro':'revenue_2017', 'founding_year':'founded_year', 'sector':'industry'})

ft1_toDrop = ['Unnamed: 0', 'absolute_growth_rate_pct', 'compound_annual_growth_rate_cagr_pct']
ft1 = ft1.drop(ft1_toDrop, axis=1)

ft1.head()

,name,country,industry,revenue_2020,revenue_2017,number_of_employees_2020,number_of_employees_2017,founded_year
0,Swappie,Finland,Technology,"97,611,814","507,000",218,1,2016
1,Kilo Health,Lithuania,Health,"57,318,766","344,428",177,10,2013
2,OCI,UK,Financial Services,"568,322,073","4,325,512",32,4,2012
3,OnlyFans,UK,Technology,"316,732,986","2,652,185",800,4,2016
4,Enpal,Germany,Energy,"56,109,613","486,165",365,9,2017

In [11]:
ft2 = ft2.rename(columns={'Name': 'name', 'revenue_2020_euro':'revenue_2020', 'revenue_2017_euro':'revenue_2017', 'Market Value':'founded_year', 'Country':'country', 'Sector':'industry', 'Revenue 2020 (€)':'revenue_2020', 'Revenue 2017 (€)':'revenue_2017', 'Number of employees 2020':'number_of_employees_2020', 'Number of employees 2017':'number_of_employees_2017', 'Founding Year': 'founded_year'})

ft2_toDrop = ['Rank', 'in 2021 ranking', 'in 2020 ranking', 'Absolute Growth Rate %','Compound Annual Growth Rate (CAGR) %']
ft2 = ft2.drop(ft2_toDrop, axis=1)

ft2.head()

,name,country,industry,revenue_2020,revenue_2017,number_of_employees_2020,number_of_employees_2017,founded_year
0,Swappie,Finland,Technology,"97,611,814","507,000",218.0,1,2016
1,Kilo Health,Lithuania,Health,"57,318,766","344,428",177.0,10,2013
2,OCI,UK,Financial Services,"568,322,073","4,325,512",32.0,4,2012
3,OnlyFans,UK,Technology,"316,732,986","2,652,185",800.0,4,2016
4,Enpal,Germany,Energy,"56,109,613","486,165",365.0,9,2017

In [12]:
ft3 = ft3.rename(columns={'employees_2017':'number_of_employees_2017', 'employees_2020': 'number_of_employees_2020', 'founding_year':'founded_year', 'sector':'industry'})

ft3.head()

,country,number_of_employees_2017,number_of_employees_2020,founded_year,name,revenue_2017,revenue_2020,industry
0,finland,1,218.0,2016,swappie,"507,000","97,611,814",technology
1,lithuania,10,177.0,2013,kilo health,"344,428","57,318,766",health
2,uk,4,32.0,2012,oci,"4,325,512","568,322,073",financial services
3,uk,4,800.0,2016,onlyfans,"2,652,185","316,732,986",technology
4,germany,9,365.0,2017,enpal,"486,165","56,109,613",energy

In [13]:
ft4 = ft4.rename(columns={'revenue_2020_EU': 'revenue_2020', 'revenue_2017_EU':'revenue_2017', 'founding_year':'founded_year', 'sector':'industry', 'employees_number_2020':'number_of_employees_2020', 'employees_number_2017':'number_of_employees_2017'})

ft4.head()

,name,country,industry,revenue_2020,revenue_2017,number_of_employees_2020,number_of_employees_2017,founded_year
0,Swappie,Finland,Technology,97611814,507000,218,1,2016
1,Kilo Health,Lithuania,Health,57318766,344428,177,10,2013
2,OCI,UK,Financial Services,568322073,4325512,32,4,2012
3,OnlyFans,UK,Technology,316732986,2652185,800,4,2016
4,Enpal,Germany,Energy,56109613,486165,365,9,2017

In [14]:
ft5 = ft5.rename(columns={'revenue': 'revenue_2020', 'founded':'founded_year', 'sector':'industry', 'employees':'number_of_employees_2020'})

ft5.head()

,link,name,country,industry,revenue_2020,number_of_employees_2020,founded_year
0,https://www.greatdealscorp.com/,Great Deals E-Commerce Corp.,Philippines,Ecommerce,88.77,385,2017
1,http://www.pclchip.com/,PCL Inc.,South Korea,Pharmaceuticals,45.48,63,2008
2,https://www.spolive.com/,Spolive,South Korea,Games industry,9.49,47,2013
3,https://www.workmate.asia/,Workmate,Singapore,Support Services,12.44,82,2015
4,http://www.taimedbiologics.com/,TaiMed Biologics,Taiwan,Pharmaceuticals,24.42,78,2007

In [15]:
merged_ft = pd.merge(ft1, ft2, on='name', how='outer')
merged_ft = pd.merge(merged_ft, ft3, on='name', how='outer')
merged_ft = pd.merge(merged_ft, ft4, on='name', how='outer')
merged_ft = pd.merge(merged_ft, ft5, on='name', how='outer')

In [18]:
merged_ft = ft1.combine_first(ft2)
merged_ft = merged_ft.combine_first(ft3)
merged_ft = merged_ft.combine_first(ft4)
merged_ft = merged_ft.combine_first(ft5)

In [19]:
merged_ft.head()

,country,founded_year,industry,link,name,number_of_employees_2017,number_of_employees_2020,revenue_2017,revenue_2020
0,Finland,2016.0,Technology,https://www.greatdealscorp.com/,Swappie,1,218,"507,000","97,611,814"
1,Lithuania,2013.0,Health,http://www.pclchip.com/,Kilo Health,10,177,"344,428","57,318,766"
2,UK,2012.0,Financial Services,https://www.spolive.com/,OCI,4,32,"4,325,512","568,322,073"
3,UK,2016.0,Technology,https://www.workmate.asia/,OnlyFans,4,800,"2,652,185","316,732,986"
4,Germany,2017.0,Energy,http://www.taimedbiologics.com/,Enpal,9,365,"486,165","56,109,613"

In [20]:
# Salva lo schema risultante
result_ft = merged_ft.to_json(orient="records")

with open('schemaAlignment/ft.json', 'w') as f:
    f.write(result_ft)

### **wikipedia.org**

In [113]:
import os
import pandas as pd

base_directory = 'de-sources-2022-2023/'
file_name = 'wikipedia.org'
file_path = os.path.join(base_directory, file_name)

file_list = os.listdir(file_path)

In [114]:
wiki = [] #Mergio prima di tutti i dataset marketcap 

for i in file_list:
  if('wikipedia' in i):
    wiki.append(i)

wiki.sort()
print(wiki)
len(wiki)

['DeBiGa-wikipedia.json', 'GioPonSpiz-wikipedia.org.json', 'MalPatSaj-wikipedia.org.xls', 'MarScoToc-wikipedia.csv']

4

In [119]:
wiki_datasets = []

for i in range(len(wiki)) :
    file_path_i = os.path.join(file_path, wiki[i])
    if('.json' in wiki[i]) :
        df = pd.read_json(file_path_i)
    elif('.xls' in wiki[i]) :
        df = pd.read_excel(file_path_i)
    elif('.csv' in wiki[i]) :
        df = pd.read_csv(file_path_i)
    wiki_datasets.append(df)

In [120]:
wiki_datasets[0].columns
wiki_datasets[0].head(1)

,name,type,industry,founded,founders,headquarters,key_people,services,revenue,operating_income,total_assets,number_of_employees,website
0,Binance,[],[cryptocurrency industry ],[July 2017],"[ (""CZ""), Yi He]",[],[],[],[US$],[],[],[],"[www, .binance, .com]"

In [130]:
wiki_datasets[0] = wiki_datasets[0].drop(['type', 'headquarters', 'key_people', 'services', 'operating_income', 'total_assets'], axis = 1)
wiki_datasets[0].rename(columns={'founded': 'founded_year', 'website': 'company_website'}, inplace = True)

wiki_datasets[0].columns

Index(['name', 'industry', 'founded_year', 'founders', 'revenue',
       'number_of_employees', 'company_website'],
      dtype='object')

In [131]:
wiki_datasets[0]['industry'] = wiki_datasets[0]['industry'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['industry'] = wiki_datasets[0]['industry'].str.replace('[','').str.replace(']','')

wiki_datasets[0]['founded_year'] = wiki_datasets[0]['founded_year'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['founded_year'] = wiki_datasets[0]['founded_year'].str.replace('[','').str.replace(']','')

wiki_datasets[0]['founders'] = wiki_datasets[0]['founders'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['founders'] = wiki_datasets[0]['founders'].str.replace('[','').str.replace(']','')

wiki_datasets[0]['revenue'] = wiki_datasets[0]['revenue'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['revenue'] = wiki_datasets[0]['revenue'].str.replace('[','').str.replace(']','')

wiki_datasets[0]['number_of_employees'] = wiki_datasets[0]['number_of_employees'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['number_of_employees'] = wiki_datasets[0]['number_of_employees'].str.replace('[','').str.replace(']','')

wiki_datasets[0]['company_website'] = wiki_datasets[0]['company_website'].apply(lambda x: ''.join(x) if type(x) == list else x)
wiki_datasets[0]['company_website'] = wiki_datasets[0]['company_website'].str.replace('[','').str.replace(']','')

wiki_datasets[0].head(1)

<ipython-input-131-5d5c1956358c>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['industry'] = wiki_datasets[0]['industry'].str.replace('[','').str.replace(']','')
<ipython-input-131-5d5c1956358c>:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['founded_year'] = wiki_datasets[0]['founded_year'].str.replace('[','').str.replace(']','')
<ipython-input-131-5d5c1956358c>:8: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['founders'] = wiki_datasets[0]['founders'].str.replace('[','').str.replace(']','')
<ipython-input-131-5d5c1956358c>:11: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['revenue'] = wiki_datasets[0]['revenue'].str.replace('[','').str.replace(']','')
<ipython-input-131-5d5c1956358c>:14: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['number_of_employees'] = wiki_datasets[0]['number_of_employees'].str.replace('[','').str.replace(']','')
<ipython-input-131-5d5c1956358c>:17: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wiki_datasets[0]['company_website'] = wiki_datasets[0]['company_website'].str.replace('[','').str.replace(']','')

,name,industry,founded_year,founders,revenue,number_of_employees,company_website
0,Binance,cryptocurrency industry,July 2017,"(""CZ"")Yi He",US$,,www.binance.com

In [128]:
wiki_datasets[1].columns
wiki_datasets[1].head(1)

            Name     Industry         Sector Headquarters Founded
0  3H Biomedical  Health care  Biotechnology      Uppsala    2004

In [137]:
wiki_datasets[1].rename(columns={'Name':'name','Industry':'industry' ,'Founded': 'founded_year', 'Sector': 'sector', 'Headquarters':'headquarters'}, inplace = True)

wiki_datasets[1].columns

Index(['name', 'industry', 'sector', 'headquarters', 'founded_year'], dtype='object')

In [92]:
wiki_datasets[2].columns
wiki_datasets[2].head(1)

,Unnamed: 0,Name,Industry,Sector,Headquarters,Founded,Notes
0,0,Agrana,Consumer goods,Food products,Vienna,1988,"Sugar, starch, fruit juice concentrates and fr..."

In [139]:
wiki_datasets[2] = wiki_datasets[2].drop(['Unnamed: 0', 'Notes'], axis = 1)
wiki_datasets[2].rename(columns={'Name':'name','Industry':'industry' , 'Sector': 'sector', 'Headquarters':'headquarters', 'Founded':'founded'}, inplace = True)

wiki_datasets[2].columns

Index(['name', 'industry', 'sector', 'headquarters', 'founded'], dtype='object')

In [93]:
wiki_datasets[3].columns
wiki_datasets[3].head(1)

,Name,Industry,headQuarters,Founded,Area Served
0,85�C Bakery Cafe,Food and Beverage,Taipei,2004; 18 years ago (2004),Worldwide

In [135]:
wiki_datasets[3] = wiki_datasets[3].drop(['Area Served'], axis = 1)
wiki_datasets[3].rename(columns={'Name':'name','Industry':'industry' , 'Founded': 'founded', 'headQuarters':'headquarters'}, inplace = True)

wiki_datasets[3].columns

Index(['name', 'industry', 'headquarters', 'founded'], dtype='object')

In [140]:
merged_wikipedia = pd.merge(wiki_datasets[0], wiki_datasets[1], how = 'outer', on = 'name')
for i in range(2, len(wiki_datasets)):
  merged_wikipedia = pd.merge(merged_wikipedia, wiki_datasets[i], how = 'outer', on = 'name')

merged_wikipedia.head()

,name,industry_x,founded_year_x,founders,revenue,number_of_employees,company_website,industry_y,sector_x,headquarters_x,founded_year_y,industry_x,sector_y,headquarters_y,founded_x,industry_y,headquarters,founded_y
0,Binance,cryptocurrency industry,July 2017,"(""CZ"")Yi He",US$,,www.binance.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Gourmet Master Co. Ltd,Food and Beverage,2004,,NT$,,www.85cafe.com1www.85cbakerycafe.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Tata Consultancy Services,Information technologyConsultingOutsourcing,1968,J. R. D. Tata,(US$25 billion) (2022),"616,1713 (October 2022)",www.tcs.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Information technology Consulting Outsourcing,Mumbai,1968; 54 years ago (1968)
3,"APMEX, Inc.",precious metals,2000,,,,www.apmex.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Bitmain Technologies Ltd.,Cryptocurrency,2013,Micree ZhanJihan Wu,,,bitmain.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [141]:
merged_wikipedia = wiki_datasets[0].combine_first(wiki_datasets[1])
merged_wikipedia = merged_wikipedia.combine_first(wiki_datasets[2])
merged_wikipedia = merged_wikipedia.combine_first(wiki_datasets[3])

In [142]:
merged_wikipedia.head()

,company_website,founded,founded_year,founders,headquarters,industry,name,number_of_employees,revenue,sector
0,www.binance.com,1988,July 2017,"(""CZ"")Yi He",Uppsala,cryptocurrency industry,Binance,,US$,Biotechnology
1,www.85cafe.com1www.85cbakerycafe.com,1479,2004,,Malmö,Food and Beverage,Gourmet Master Co. Ltd,,NT$,Food products
2,www.tcs.com,1983,1968,J. R. D. Tata,Gothenburg,Information technologyConsultingOutsourcing,Tata Consultancy Services,"616,1713 (October 2022)",(US$25 billion) (2022),Food products
3,www.apmex.com,1763,2000,,Svängsta,precious metals,"APMEX, Inc.",,,Recreational products
4,bitmain.com,1981,2013,Micree ZhanJihan Wu,Stockholm,Cryptocurrency,Bitmain Technologies Ltd.,,,Software

In [143]:
merged_wikipedia.replace('', np.nan, inplace=True)
merged_wikipedia.head()

,company_website,founded,founded_year,founders,headquarters,industry,name,number_of_employees,revenue,sector
0,www.binance.com,1988,July 2017,"(""CZ"")Yi He",Uppsala,cryptocurrency industry,Binance,NaN,US$,Biotechnology
1,www.85cafe.com1www.85cbakerycafe.com,1479,2004,NaN,Malmö,Food and Beverage,Gourmet Master Co. Ltd,NaN,NT$,Food products
2,www.tcs.com,1983,1968,J. R. D. Tata,Gothenburg,Information technologyConsultingOutsourcing,Tata Consultancy Services,"616,1713 (October 2022)",(US$25 billion) (2022),Food products
3,www.apmex.com,1763,2000,NaN,Svängsta,precious metals,"APMEX, Inc.",NaN,NaN,Recreational products
4,bitmain.com,1981,2013,Micree ZhanJihan Wu,Stockholm,Cryptocurrency,Bitmain Technologies Ltd.,NaN,NaN,Software

In [144]:
# Salva lo schema risultante
result_wiki = merged_wikipedia.to_json(orient="records")

with open('schemaAlignment/wikipedia.json', 'w') as f:
    f.write(result_wiki)

### **ariregister.rik.ee**

In [145]:
base_directory_ari = 'de-sources-2022-2023/'
file_name_ari = 'ariregister.rik.ee'
file_path_ari = os.path.join(base_directory_ari, file_name_ari)

file_list_ari = os.listdir(file_path_ari)

In [146]:
ari = [] #Mergio prima di tutti i dataset marketcap 

for i in file_list_ari:
  if('ariregister' in i):
    ari.append(i)

ari.sort()
print(ari)
len(ari)

['wissel-activity-ariregister.rik.ee.csv', 'wissel-aziende-ariregister.rik.ee.csv', 'wissel-partners-ariregister.rik.ee.csv', 'wissel-rappresentanti-ariregister.rik.ee.csv']

4

In [148]:
ari_datasets = []

for i in range(len(ari)) :
    file_path_a = os.path.join(file_path_ari, ari[i])
    if('.csv' in ari[i]) :
        df = pd.read_csv(file_path_a)
    
    ari_datasets.append(df)

In [149]:
ari_datasets[0].columns
ari_datasets[0].head(1)

,ID azienda,Area of Activity,EMTAK Code,NACE Code,Source
0,2,Other activities auxiliary to financial servic...,66199 (EMTAK 2008),66.19,Electronic submission\n ...

In [165]:
ari_datasets[0] = ari_datasets[0].drop(['Source', 'EMTAK Code', 'NACE Code'], axis = 1)
ari_datasets[0].rename(columns={'ID azienda':'id','Area of Activity':'activity_area' , 'Source': 'source'}, inplace = True)

ari_datasets[0].columns

Index(['id', 'activity_area'], dtype='object')

In [150]:
ari_datasets[1].columns
ari_datasets[1].head(1)

,URL,ID,Name,Code,Legal form,Status,Registration Date,Capital,Address,Deletion Date
0,https://ariregister.rik.ee/eng/company/1431887...,1,10DspaceOÃœ(14318875),14318875.0,Private limited company,Deleted,25.08.2017,NaN,NaN,29.05.2020

In [166]:
ari_datasets[1] = ari_datasets[1].drop(['Status', 'Registration Date', 'Deletion Date'], axis = 1)
ari_datasets[1].rename(columns={'ID':'id','URL':'url' , 'Name': 'name', 'Code':'code', 'Capital':'capital', 'Address':'address'}, inplace = True)

ari_datasets[1].columns

Index(['url', 'id', 'name', 'code', 'Legal form', 'capital', 'address'], dtype='object')

In [162]:
ari_datasets[2].columns
ari_datasets[2].head(1)

,ID azienda,Name,Code,Participation,Contribution
0,2,\n Jani...,38807314918\n,70.00%,\n 7000.00 ...

In [168]:
ari_datasets[2].rename(columns={'ID azienda':'id', 'Name': 'name', 'Code':'code', 'Participation':'participation', 'Contribution':'contribution'}, inplace = True)
ari_datasets[2].columns

Index(['id', 'name', 'code', 'participation', 'contribution'], dtype='object')

In [163]:
ari_datasets[3].columns
ari_datasets[3].head(1)

,ID azienda,Name,Code,Role,Start Date
0,2,\n Janis Jegi\n...,\n 38807314...,\n Management b...,14.07.2021

In [169]:
ari_datasets[3] = ari_datasets[3].drop(['Start Date'], axis = 1)
ari_datasets[3].rename(columns={'ID azienda':'id', 'Name': 'name', 'Code':'code', 'Role':'role'}, inplace = True)

ari_datasets[3].columns

Index(['id', 'name', 'code', 'role'], dtype='object')

In [171]:
merged_ariregister = pd.merge(ari_datasets[0], ari_datasets[1], how = 'outer', on = 'id')
for i in range(2, len(ari_datasets)):
  merged_ariregister = pd.merge(merged_ariregister, ari_datasets[i], how = 'outer', on = 'id')

In [172]:
merged_ariregister = ari_datasets[0].combine_first(ari_datasets[1])
merged_ariregister = merged_ariregister.combine_first(ari_datasets[2])
merged_ariregister = merged_ariregister.combine_first(ari_datasets[3])

In [173]:
merged_ariregister.head()

,Legal form,activity_area,address,capital,code,contribution,id,name,participation,role,url
0,Private limited company,Other activities auxiliary to financial servic...,NaN,NaN,14318875.0,\n 7000.00 ...,2.0,10DspaceOÃœ(14318875),70.00%,\n Management b...,https://ariregister.rik.ee/eng/company/1431887...
1,Private limited company,Specialised design activities,Harju maakond Tallinn ...,Capitalis10Â 000Â â‚¬,16270291.0,\n 3000.00 ...,3.0,21SparrowsOÃœ(16270291),30.00%,\n Management b...,https://ariregister.rik.ee/eng/company/1627029...
2,Private limited company,Computer programming activities,Harju maakond Tallinn ...,Capitalis2Â 500Â â‚¬,12454634.0,\n 2500.00 ...,4.0,3DSTOÃœ(12454634),100.00%,\n Management b...,https://ariregister.rik.ee/eng/company/1245463...
3,Private limited company,Construction of residential and non-residentia...,Harju maakond Tallinn ...,Capitalis2Â 500Â â‚¬,14867109.0,\n 2500.00 ...,5.0,8BitsSpaceOÃœ(14867109),100.00%,\n Management b...,https://ariregister.rik.ee/eng/company/1486710...
4,Private limited company,Renting and operational leasing of other machi...,PÃµlva maakond PÃµlva ...,Capitalis2Â 500Â â‚¬,16451101.0,\n 1250.00 ...,6.0,A1EhituspartnerOÃœ(16451101),50.00%,\n Management b...,https://ariregister.rik.ee/eng/company/1645110...

### **Aziende singole**

In [53]:
base_directory = 'de-sources-2022-2023/'
file_name = 'altreAziende'
file_path = os.path.join(base_directory, file_name)

file_list = os.listdir(file_path)

print(file_list)
len(file_list)

['avengers-hithorizons.json', 'DDD-teamblind.com.csv', 'DeBiGa-globaldata.json', 'DeBiGa-govuk.json', 'FR-campaignindia.csv', 'FR-company_social_urls.csv', 'FR-famcap_germany.csv', 'FR-followers.csv', 'FR-sole24ore.csv', 'MarScoToc-ambitionbox.com.csv', 'wissel-aziende-gov.uk.csv', 'wissel-aziende-info-clipper.com.csv']

12

In [55]:
aziende = [] #Mergio prima di tutti i dataset 

for i in file_list:
    aziende.append(i)

aziende.sort()
print(aziende)
len(aziende)

['DDD-teamblind.com.csv', 'DeBiGa-globaldata.json', 'DeBiGa-govuk.json', 'FR-campaignindia.csv', 'FR-company_social_urls.csv', 'FR-famcap_germany.csv', 'FR-followers.csv', 'FR-sole24ore.csv', 'MarScoToc-ambitionbox.com.csv', 'avengers-hithorizons.json', 'wissel-aziende-gov.uk.csv', 'wissel-aziende-info-clipper.com.csv']

12

In [56]:
from IPython.core.display import json
import pandas as pd

aziende_datasets = []

for i in range(len(aziende)):
  file_path_aziende = os.path.join(file_path, aziende[i])
  if('.csv' in aziende[i]):
    try:
      df = pd.read_csv(file_path_aziende)
    except:
      df = pd.read_csv(file_path_aziende, encoding = 'ISO-8859-1')
  if('.xlsx' in aziende[i]):
    df = pd.read_excel(file_path_aziende)
  elif('.json' in aziende[i]):
    try:
      df = pd.read_json(file_path_aziende)
    except:
      df = pd.read_json(file_path_aziende, lines= True)
  aziende_datasets.append(df)

In [57]:
aziende_datasets[0].columns
aziende_datasets[0].head(1)

,Unnamed: 0,name,website,locations,size,industry,founded
0,0,Proteus Digital Health Careers,www.proteus.com,"Redwood City, CA",201 to 500 employees,Pharmaceuticals,2004

In [58]:
aziende_datasets[0] = aziende_datasets[0].drop('Unnamed: 0', axis = 1)
aziende_datasets[0].rename(columns={'website': 'company_website', 
                                    'locations': 'country',
                                    'size': 'number_of_employees',
                                    'founded': 'founded_year'}, inplace = True)
aziende_datasets[0].columns

Index(['name', 'company_website', 'country', 'number_of_employees', 'industry',
       'founded_year'],
      dtype='object')

In [59]:
aziende_datasets[1].columns
aziende_datasets[1].head(1)

,name,headquarters,number_of_employees,address,industry,website,market_cap,telephone,revenue
0,US Ecology Inc,United States of America,"3,600","101 S Capitol Blvd Ste 1000, Boise, Idaho, 83702",Environmental and Waste Management Services,www.usecology.com,None,1 208 3318400,$988.0M

In [60]:
aziende_datasets[1] = aziende_datasets[1].drop('telephone', axis = 1)
aziende_datasets[1].rename(columns={'website': 'company_website', 
                                    'headquarters': 'country'}, inplace = True)
aziende_datasets[1].columns

Index(['name', 'country', 'number_of_employees', 'address', 'industry',
       'company_website', 'market_cap', 'revenue'],
      dtype='object')

In [61]:
aziende_datasets[2].columns
aziende_datasets[2].head(1)

,name,company_number,registered_office_address,company_status,company_type,company_creation_date,nature_of_business
0,INGRAM MICRO (UK) LIMITED,01609968,"Cbxii, 406-432 Midsummer Boulevard, Milton Key...",Active,Private limited Company,29 January 1982,"46510 - Wholesale of computers, computer perip..."

In [62]:
aziende_datasets[2] = aziende_datasets[2].drop(['company_number', 'nature_of_business', 'company_status', 'company_type'], axis = 1)
aziende_datasets[2].rename(columns={'registered_office_address': 'address', 
                                    'company_creation_date': 'founded_year'}, inplace = True)
aziende_datasets[2].columns

Index(['name', 'address', 'founded_year'], dtype='object')

In [63]:
aziende_datasets[3].columns
aziende_datasets[3].head(1)

   RANK BRAND NAME              CATEGORY MAIN MARKET 2010 RANK
0     1       Sony  Consumer electronics    Regional         1

In [64]:
aziende_datasets[3] = aziende_datasets[3].drop(['2010 RANK', 'MAIN MARKET'], axis = 1)
aziende_datasets[3].rename(columns={'RANK': 'rank',
                                    'BRAND NAME': 'name', 
                                    'CATEGORY': 'categories'}, inplace = True)
aziende_datasets[3].columns

Index(['rank', 'name', 'categories'], dtype='object')

In [65]:
aziende_datasets[4].columns
aziende_datasets[4].head(1)

,Company,Facebook,Twitter,Instagram,Pinterest
0,The Hershey Company,https://www.facebook.com/HersheyCompany/,https://twitter.com/hersheycompany,https://www.instagram.com/hersheycompany/,https://www.pinterest.com/hersheycompany/

In [66]:
aziende_datasets[4].rename(columns={'Company': 'name'}, inplace = True)
aziende_datasets[4].columns

Index(['name', 'Facebook', 'Twitter', 'Instagram', 'Pinterest'], dtype='object')

In [67]:
aziende_datasets[5].columns
aziende_datasets[5].head(1)

,Rank,Company,Revenues 2018 $m,Employees,Family ownership,Founded,Public/Private,Generation,Family executive,Woman in leadership,Sector,Headquarters,State (abbreviation),Website
0,1,Volkswagen Group,"266,315.1","665,260","Porsche, Piech",1937,Public,4,No,Yes,Automotive,Wolfsburg,NI,www.volkswagenag.de

In [68]:
aziende_datasets[5] = aziende_datasets[5].drop(['Family ownership', 'Public/Private', 'Generation', 'Family executive', 'Woman in leadership'], axis = 1)
aziende_datasets[5].rename(columns={'Company': 'name',
                                    'Rank': 'rank',
                                    'Sector': 'sector',
                                    'Headquarters': 'headquarters',
                                    'Website': 'company_website',
                                    'State (abbreviation)': 'country',
                                    'Founded': 'founded_year',
                                    'Revenues 2018 $m': 'revenue',
                                    'Employees': 'number_of_employees'}, inplace = True)
aziende_datasets[5].columns

Index(['rank', 'name', 'revenue', 'number_of_employees', 'founded_year',
       'sector', 'headquarters', 'country', 'company_website'],
      dtype='object')

In [69]:
aziende_datasets[5]['founded_year']=aziende_datasets[5]['founded_year'].astype(object)

In [70]:
aziende_datasets[6].columns
aziende_datasets[6].head(1)

,Company,Facebook,Twitter,Instagram,Pinterest
0,Apple,14.031.481 persone seguono questa Pagina,"8,8 Mln",28.9M follower,-

In [71]:
aziende_datasets[6].rename(columns={'Company': 'name'}, inplace = True)
aziende_datasets[6].columns

Index(['name', 'Facebook', 'Twitter', 'Instagram', 'Pinterest'], dtype='object')

In [72]:
aziende_datasets[7].columns
aziende_datasets[7].head(1)

,Via Maurizio Gonzaga 5,Unnamed: 1,E-commerce,7.337,Winelivery S.r.l.
0,Via Damiano Chiesa 53,Bitritto,Servizi generali,8.375,Pegaso Security S.r.l.

In [73]:
aziende_datasets[7] = aziende_datasets[7].drop(aziende_datasets[7].columns, axis = 1, inplace = True)

In [74]:
aziende_datasets[8].columns
aziende_datasets[8].head(1)

,Name,Industry,Headquarter,Ownership,Foundation Year
0,TCS,IT Services & Consulting,"Mumbai, Maharashtra, India",Public,1968 (55 yrs old)

In [75]:
aziende_datasets[8] = aziende_datasets[8].drop('Ownership', axis = 1)
aziende_datasets[8].rename(columns={'Name': 'name',
                                    'Industry': 'industry',
                                    'Headquarter': 'headquarters',
                                    'Foundation Year': 'founded_year'}, inplace = True)
aziende_datasets[8].columns

Index(['name', 'industry', 'headquarters', 'founded_year'], dtype='object')

In [76]:
aziende_datasets[9].columns
aziende_datasets[9].head(1)

,id,name,address,nation,hhid,industry,sic_code,type,est_of_ownership
0,d60823f20d864692b517a8ad6c1418ed,Enel Spa,"VIALE REGINA MARGHERITA 137, ROMA, 00198, ROMA...",IT00934061003,H-IT0031426662,"Finance, Insurance, and Real Estate",Holding company (6719),Corporation,1962

In [77]:
aziende_datasets[9] = aziende_datasets[9].drop(['id', 'nation', 'hhid', 'sic_code', 'type'], axis = 1)
aziende_datasets[9].rename(columns={'est_of_ownership': 'founded_year'}, inplace = True)
aziende_datasets[9].columns

Index(['name', 'address', 'industry', 'founded_year'], dtype='object')

In [78]:
aziende_datasets[9]['founded_year']=aziende_datasets[9]['founded_year'].astype(object)

In [79]:
aziende_datasets[10].columns
aziende_datasets[10].head(1)

,URL,ID,Name,Company ID,Company Status,Company Type,Registration Date,Incorporation Date,Dissolution Date,Office Address
0,https://find-and-update.company-information.se...,1,A LIMITED,11790215,Active,PrivatelimitedCompany,NaN,28 January 2019,NaN,38SpringfieldRoad Gillingham Kent England ME71YJ

In [80]:
aziende_datasets[10] = aziende_datasets[10].drop(aziende_datasets[10].columns, axis = 1, inplace = True)

In [81]:
aziende_datasets[11].columns
aziende_datasets[11].head(1)

,Unnamed: 0,INDEX,URL,Name,Trade Name,Address Name,Postalcode,City,State,Country,Location type
0,0,0,https://www.info-clipper.com/en/company/united...,"CNHI, LLC",NaN,445 DEXTER AVE,361043892,MONTGOMERY,Alabama(AL),UNITED STATES,Headquarter

In [82]:
aziende_datasets[11] = aziende_datasets[11].drop(aziende_datasets[11].columns, axis = 1, inplace = True)

In [84]:
aziende_merged = pd.merge(aziende_datasets[0], aziende_datasets[1], how = 'outer', on = None)
for i in range(2, len(aziende_datasets)):
  if not(aziende_datasets[i] is None):
    aziende_merged = pd.merge(aziende_merged, aziende_datasets[i], how = 'outer', on = None)

aziende_merged

,name,company_website,country,number_of_employees,industry,founded_year,address,market_cap,revenue,rank,categories,Facebook,Twitter,Instagram,Pinterest,sector,headquarters
0,Proteus Digital Health Careers,www.proteus.com,"Redwood City, CA",201 to 500 employees,Pharmaceuticals,2004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Zelis Careers,www.zelis.com,"Bedminster, NJ","1,001 to 5,000 employees",Information Technology & Services,2016,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,UpNest Careers,www.upnest.com,"Burlingame, CA",1 to 50 employees,Real Estate,2013,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,conferacity Careers,conferacity.com,"Menlo Park, CA",1 to 50 employees,Broadcast & Online Media,2013,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Zenoti Careers,www.zenoti.com,"Bellevue, WA","501 to 1,000 employees",Computer Software,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26936,Legacy Srl,NaN,NaN,NaN,"Finance, Insurance, and Real Estate",2019,"VIA DELLA ZECCA 2, BOLOGNA, 40121, BOLOGNA, ITALY",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26937,Cribis Holding Srl,NaN,NaN,NaN,"Finance, Insurance, and Real Estate",2010,"VIA DELLA ZECCA 2, BOLOGNA, 40121, BOLOGNA, ITALY",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26938,Porsche Italia Spa,NaN,NaN,NaN,Retail Trade,1989,"CORSO STATI UNITI 35, PADOVA, 35127, PADOVA, I...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26939,Intesa Sanpaolo Rbm Salute Spa,NaN,NaN,NaN,"Finance, Insurance, and Real Estate",2007,"VIALE STELVIO 55/57, MILANO, 20159, MILANO, ITALY",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26940,Brenntag Spa,NaN,NaN,NaN,Wholesale Trade,1952,"STRADA 6 PALAZZO A 13 MILANOFIORI 0SNC, ASSAGO...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [85]:
# Salva il dataset risultante
result_aziende = aziende_merged.to_json(orient="records")

with open('schemaAlignment/altreAziende.json', 'w') as f:
    f.write(result_aziende)

## Unione di tutti i dataset

In [ ]:
directory = '/schemaAlignment'

file_list = os.listdir(directory)
print(file_list)
len(file_list)

In [ ]:
file_list.sort()

print(file_list)
len(file_list)

In [ ]:
from IPython.core.display import json
import pandas as pd

aziende_datasets = []

for i in range(len(file_list)):
  if('.csv' in file_list[i]):
    try:
      df = pd.read_csv(file_list[i])
    except:
      df = pd.read_csv(file_list[i], encoding = 'ISO-8859-1')
  if('.json' in file_list[i]):
    try:
      df = pd.read_json(file_list[i])
    except:
      df = pd.read_json(file_list[i], lines= True)
 
  aziende_datasets.append(df)

In [ ]:
aziende_datasets[0].columns

In [ ]:
aziende_datasets[0] = aziende_datasets[0].drop(['Unnamed: 0', 'address', 'Facebook', 'Twitter', 'Instagram',
                                                'Pinterest', 'state', 'categories', 'Company Status', 'headquarters',
                                                'Incorporation Date', 'postal_code'], axis = 1)

In [ ]:
aziende_datasets[0]['rank'] = aziende_datasets[0]['rank'].astype(object)

In [ ]:
aziende_datasets[1].head(1)

In [ ]:
aziende_datasets[1] = aziende_datasets[1].drop(['investors', 'dateJoined', 'stage'], axis = 1)
aziende_datasets[1].rename(columns={'founded': 'founded_year',
                                    'totalRaised': 'revenue'}, inplace = True)

In [ ]:
aziende_datasets[2] = aziende_datasets[2].drop(['Unnamed: 0', 'headquarters', 'top competitor', 'id', 'official_name',
                                                'headquarters_country', 'headquarters_continent', 'categories', 'gbp',
                                                'net income', 'link'], axis = 1)

In [ ]:
aziende_datasets[3].columns

In [ ]:
aziende_datasets[3].rename(columns={'founded': 'founded_year'}, inplace = True)

In [ ]:
aziende_datasets[4].head(2)

In [ ]:
aziende_datasets[4] = aziende_datasets[4].drop(['number_of_employees_2017', 'revenue_2017'], axis = 1)
aziende_datasets[4].rename(columns={'number_of_employees_2020': 'number_of_employees',
                                    'revenue_2020': 'revenue',
                                    'link': 'company_website'}, inplace = True)

In [ ]:
aziende_datasets[4]['founded_year'] = aziende_datasets[4]['founded_year'].astype(object)

In [ ]:
aziende_datasets[5].columns

In [ ]:
aziende_datasets[5] = aziende_datasets[5].drop(['Unnamed: 0', 'net_income', 'categories'], axis = 1)
aziende_datasets[5].rename(columns={'price': 'valuation',
                                    'revenue_2020': 'revenue',
                                    'link': 'company_website'}, inplace = True)

In [ ]:
aziende_datasets[5]['rank'] = aziende_datasets[5]['rank'].astype(object)

In [ ]:
aziende_datasets[6].columns

In [ ]:
aziende_datasets[6] = aziende_datasets[6].drop(['founders', 'industry'], axis = 1)
aziende_datasets[6].rename(columns={'market_value': 'valuation'}, inplace = True)

In [ ]:
aziende_datasets[7].columns

In [ ]:
aziende_datasets[7] = aziende_datasets[7].drop(['founded', 'headquarters', 'founders'], axis = 1)

In [ ]:
aziendeFinale_merged = pd.merge(aziende_datasets[0], aziende_datasets[1], how = 'outer', on = None)
for i in range(2, len(aziende_datasets)):
  aziendeFinale_merged = pd.merge(aziendeFinale_merged, aziende_datasets[i], how = 'outer', on = None)

aziendeFinale_merged

In [ ]:
# Salva il dataset risultante
result_aziendeFinale = aziendeFinale_merged.to_csv(orient="records")

with open('schemaAlignment/aziende_merged_finale', 'w') as f:
    f.write(result_aziendeFinale)